
#Requisitos Funcionales para cada servicio:
PREFIX owl: <http://www.w3.org/2002/07/owl#>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>
PREFIX on: <https://www.ia.urjc.es/ontologies/ontologyNetwork/>

SELECT DISTINCT  ?serv ?fr
WHERE {
	?fr rdf:type/rdfs:subClassOf* on:FunctionalRequirement.
	?serv on:hasRequirement ?fr.
	?serv rdf:type on:Service .
}ORDER BY ?serv



########################################################
#Requisitos Computacionales para cada servicio:
PREFIX owl: <http://www.w3.org/2002/07/owl#>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>
PREFIX on: <https://www.ia.urjc.es/ontologies/ontologyNetwork/>

SELECT DISTINCT  ?serv ?cr ?val
WHERE {
	?cr rdf:type/rdfs:subClassOf* on:ComputationalRequirement.
	?serv on:hasRequirement ?cr.
	?serv rdf:type on:Service .
	?cr on:hasValue ?val.
}ORDER BY ?serv




########################################################
#Recursos Computacionales para cada nodo:
PREFIX owl: <http://www.w3.org/2002/07/owl#>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>
PREFIX on: <https://www.ia.urjc.es/ontologies/ontologyNetwork/>

SELECT DISTINCT  ?serv ?cr ?val
WHERE {
	?cr rdf:type/rdfs:subClassOf* on:ComputationalResource.
	?serv on:hasResource?cr.
	?cr on:hasValue ?val.
}ORDER BY ?serv




########################################################
#Recursos Funcionales para cada nodo:
PREFIX owl: <http://www.w3.org/2002/07/owl#>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>
PREFIX on: <https://www.ia.urjc.es/ontologies/ontologyNetwork/>

SELECT DISTINCT  ?cn ?cr
WHERE {
	?cr rdf:type/rdfs:subClassOf on:FunctionalResource.
	?cn on:hasResource ?cr.
}ORDER BY ?cn



########################################################
#Recursos Funcionales disponibles en una localización (los nodos contenidos en dicha localización pueden compartir los recursos computacionales):
PREFIX owl: <http://www.w3.org/2002/07/owl#>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>
PREFIX on: <https://www.ia.urjc.es/ontologies/ontologyNetwork/>

SELECT DISTINCT  ?location  ?cr ?cn 
WHERE {
	?cr rdf:type/rdfs:subClassOf on:FunctionalResource.
	?cn on:hasResource ?cr.
	?cn on:physicallyLocatedAt ?location.
	?location rdf:type/rdfs:subClassOf on:Location.
}ORDER BY ?cn
